
 $(document).ready(function(){

              $("#alert-basic").click(function(){
                  swal("لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی");
              });

              $("#alert-title").click(function(){
                  swal("اینجا عنوان است!", "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی");
              });

              $("#alert-success").click(function(){
                  swal("آفرین!", "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی", "success");
              });

              $("#alert-error").click(function(){
                  swal("چیزی اشتباه است!", "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی,", "error");
              });

              $("#alert-info").click(function(){
                  swal("اطلاعات!", "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی,", "info");
              });

              $("#alert-warning").click(function(){
                  swal("هشدار!", "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی,", "warning");
              });


              $("#confirm-btn-alert").click(function(){

                  swal({
                    title: "شما مطمئن هستید؟",
                    text: "پس از حذف شدن، قادر نخواهید بود که این فایل خیالی را بازیابی کنید!",
                    icon: "warning",
                    buttons: true,
                    dangerMode: true,
                  })
                  .then((willDelete) => {
                    if (willDelete) {
                      swal("پوف! فایل خیالی شما حذف شده است!", {
                        icon: "success",
                      });
                    } else {
                      swal("فایل خیالی شما امن است!");
                    }
                  });

              });

          });